[
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Establish network segmentation boundaries",
        "Parent Description": "",
        "Child": "Adaptive network hardening recommendations should be applied on internet facing virtual machines",
        "Child Description": "Azure Security Center analyzes the traffic patterns of Internet facing virtual machines and provides Network Security Group rule recommendations that reduce the potential attack surface.",
        "Grand Child": "Manual verification required. Check control description for more details.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Establish network segmentation boundaries",
        "Parent Description": "",
        "Child": "All network ports should be restricted on network security groups associated to your virtual machine",
        "Child Description": "Azure Security Center has identified some of your network security groups' inbound rules to be too permissive. Inbound rules should not allow access from 'Any' or 'Internet' ranges. This can potentially enable attackers to target your resources.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Establish network segmentation boundaries",
        "Parent Description": "",
        "Child": "Internet-facing virtual machines should be protected with network security groups",
        "Child Description": "Protect your virtual machines from potential threats by restricting access to them with network security groups (NSG).",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Establish network segmentation boundaries",
        "Parent Description": "",
        "Child": "Non-internet-facing virtual machines should be protected with network security groups",
        "Child Description": "Protect your non-internet-facing virtual machines from potential threats by restricting access with network security groups (NSG).",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Establish network segmentation boundaries",
        "Parent Description": "",
        "Child": "Subnets should be associated with a Network Security Group",
        "Child Description": "This policy denies if a gateway subnet is configured with a network security group. Assigning a network security group to a gateway subnet will cause the gateway to stop functioning.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Ensure that Private Endpoints are Used for Azure Key Vault",
        "Child Description": "Private endpoints will secure network traffic from Azure Key Vault to the resources requesting secrets and keys.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Ensure that 'Public access level' is set to Private for blob containers",
        "Child Description": "Disable anonymous access to blob containers and disallow blob public access on storage account.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "API Management services should use a virtual network",
        "Child Description": "Azure Virtual Network deployment provides enhanced security, isolation and allows you to place your API Management service in a non-internet routable network that you control access to. These networks can then be connected to your on-premises networks using various VPN technologies, which enables access to your backend services within the network and/or on-premises. The developer portal and API gateway, can be configured to be accessible either from the Internet or only within the virtual network.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "App Configuration should use private link",
        "Child Description": "Azure Private Link lets you connect your virtual network to Azure services without a public IP address at the source or destination. The private link platform handles the connectivity between the consumer and services over the Azure backbone network. By mapping private endpoints to your app configuration instances instead of the entire service, you'll also be protected against data leakage risks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Authorized IP ranges should be defined on Kubernetes Services",
        "Child Description": "ARestrict access to the Kubernetes Service Management API by granting API access only to IP addresses in specific ranges. It is recommended to limit access to authorized IP ranges to ensure that only applications from allowed networks can access the cluster.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Azure Cache for Redis should use private link",
        "Child Description": "Private endpoints lets you connect your virtual network to Azure services without a public IP address at the source or destination. By mapping private endpoints to your Azure Cache for Redis instances, data leakage risks are reduced.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Azure Cosmos DB accounts should have firewall rules",
        "Child Description": "Firewall rules should be defined on your Azure Cosmos DB accounts to prevent traffic from unauthorized sources. Accounts that have at least one IP rule defined with the virtual network filter enabled are deemed compliant. Accounts disabling public access are also deemed compliant.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Azure Event Grid domains should use private link",
        "Child Description": "Azure Private Link lets you connect your virtual network to Azure services without a public IP address at the source or destination. The Private Link platform handles the connectivity between the consumer and services over the Azure backbone network. By mapping private endpoints to your Event Grid domain instead of the entire service, you'll also be protected against data leakage risks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Azure Event Grid topics should use private link",
        "Child Description": "Azure Private Link lets you connect your virtual network to Azure services without a public IP address at the source or destination. The Private Link platform handles the connectivity between the consumer and services over the Azure backbone network. By mapping private endpoints to your Event Grid topic instead of the entire service, you'll also be protected against data leakage risks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Azure SignalR Service should use private link",
        "Child Description": "Azure Private Link lets you connect your virtual network to Azure services without a public IP address at the source or destination. The private link platform handles the connectivity between the consumer and services over the Azure backbone network. By mapping private endpoints to your Azure SignalR Service resource instead of the entire service, you'll reduce your data leakage risks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Azure Spring Cloud should use network injection",
        "Child Description": "Azure Spring Cloud instances should use virtual network injection for the following purposes: 1. Isolate Azure Spring Cloud from Internet. 2. Enable Azure Spring Cloud to interact with systems in either on premises data centers or Azure service in other virtual networks. 3. Empower customers to control inbound and outbound network communications for Azure Spring Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Cognitive Services accounts should disable public network access",
        "Child Description": "Disabling public network access improves security by ensuring that Cognitive Services account isn't exposed on the public internet. Creating private endpoints can limit exposure of Cognitive Services account.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Cognitive Services accounts should restrict network access",
        "Child Description": "Network access to Cognitive Services accounts should be restricted. Configure network rules so only applications from allowed networks can access the Cognitive Services account. To allow connections from specific internet or on-premises clients, access can be granted to traffic from specific Azure virtual networks or to public internet IP address ranges.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Public network access on Azure SQL Database should be disabled",
        "Child Description": "Disabling the public network access property improves security by ensuring your Azure SQL Database can only be accessed from a private endpoint. This configuration denies all logins that match IP or virtual network based firewall rules.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Public network access should be disabled for MariaDB servers",
        "Child Description": "Disable the public network access property to improve security and ensure your Azure Database for MariaDB can only be accessed from a private endpoint. This configuration strictly disables access from any public address space outside of Azure IP range, and denies all logins that match IP or virtual network-based firewall rules.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Public network access should be disabled for MySQL servers",
        "Child Description": "Disable the public network access property to improve security and ensure your Azure Database for MySQL can only be accessed from a private endpoint. This configuration strictly disables access from any public address space outside of Azure IP range, and denies all logins that match IP or virtual network-based firewall rules.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Public network access should be disabled for PostgreSQL servers",
        "Child Description": "Disable the public network access property to improve security and ensure your Azure Database for PostgreSQL can only be accessed from a private endpoint. This configuration disables access from any public address space outside of Azure IP range, and denies all logins that match IP or virtual network-based firewall rules.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Secure cloud services with network controls",
        "Parent Description": "",
        "Child": "Storage accounts should restrict network access using virtual network rules",
        "Child Description": "Protect your storage accounts from potential threats using virtual network rules as a preferred method instead of IP-based filtering. Disabling IP-based filtering prevents public IPs from accessing your storage accounts.",
        "Grand Child": "cs210032000de891a1b allows network access.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Deploy firewall at the edge of enterprise network",
        "Parent Description": "",
        "Child": "IP Forwarding on your virtual machine should be disabled",
        "Child Description": "Enabling IP forwarding on a virtual machine's NIC allows the machine to receive traffic addressed to other destinations. IP forwarding is rarely required (e.g., when using the VM as a network virtual appliance), and therefore, this should be reviewed by the network security team.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Deploy firewall at the edge of enterprise network",
        "Parent Description": "",
        "Child": "Management ports of virtual machines should be protected with just-in-time network access control.",
        "Child Description": "Possible network Just In Time (JIT) access will be monitored by Azure Security Center as recommendations",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Deploy firewall at the edge of enterprise network",
        "Parent Description": "",
        "Child": "Management ports should be closed on your virtual machines",
        "Child Description": "Open remote management ports are exposing your VM to a high level of risk from Internet-based attacks. These attacks attempt to brute force credentials to gain admin access to the machine.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Deploy firewall at the edge of enterprise network",
        "Parent Description": "",
        "Child": "Azure DDoS Protection Standard should be enabled",
        "Child Description": "DDoS protection standard should be enabled for all virtual networks with a subnet that is part of an application gateway with a public IP.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Deploy web application firewall",
        "Parent Description": "",
        "Child": "Web Application Firewall (WAF) should be enabled for Azure Front Door Service service",
        "Child Description": "Deploy Azure Web Application Firewall (WAF) in front of public facing web applications for additional inspection of incoming traffic. Web Application Firewall (WAF) provides centralized protection of your web applications from common exploits and vulnerabilities such as SQL injections, Cross-Site Scripting, local and remote file executions. You can also restrict access to your web applications by countries, IP address ranges, and other http(s) parameters via custom rules.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Deploy web application firewall",
        "Parent Description": "",
        "Child": "Web Application Firewall (WAF) should be enabled for Application Gateway",
        "Child Description": "Deploy Azure Web Application Firewall (WAF) in front of public facing web applications for additional inspection of incoming traffic. Web Application Firewall (WAF) provides centralized protection of your web applications from common exploits and vulnerabilities such as SQL injections, Cross-Site Scripting, local and remote file executions. You can also restrict access to your web applications by countries, IP address ranges, and other http(s) parameters via custom rules.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Simplify network security configuration",
        "Parent Description": "",
        "Child": "Adaptive network hardening recommendations should be applied on internet facing virtual machines",
        "Child Description": "Azure Security Center analyzes the traffic patterns of Internet facing virtual machines and provides Network Security Group rule recommendations that reduce the potential attack surface.",
        "Grand Child": "Manual verification required. Check control description for more details.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Detect and disable insecure services and protocols",
        "Parent Description": "",
        "Child": "Ensure web app is using the latest version of TLS encryption",
        "Child Description": "The TLS(Transport Layer Security) protocol secures transmission of data over the internet using standard encryption technology. Encryption should be set with the latest version of TLS. App service allows TLS 1.2 by default, which is the recommended TLS level by industry standards, such as PCI DSS.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Detect and disable insecure services and protocols",
        "Parent Description": "",
        "Child": "Latest TLS version should be used in your Function App",
        "Child Description": "Upgrade to the latest TLS version.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Network Security",
        "Grand Parent Description": "",
        "Parent": "Ensure Domain Name System (DNS) security",
        "Parent Description": "",
        "Child": "Azure Defender for DNS should be enabled",
        "Child Description": "Azure Defender for DNS provides an additional layer of protection for your cloud resources by continuously monitoring all DNS queries from your Azure resources. Azure Defender alerts you about suspicious activity at the DNS layer.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Use centralized identity and authentication system",
        "Parent Description": "",
        "Child": "An Azure Active Directory administrator should be provisioned for SQL servers",
        "Child Description": "Audit provisioning of an Azure Active Directory administrator for your SQL server to enable Azure AD authentication. Azure AD authentication enables simplified permission management and centralized identity management of database users and other Microsoft services.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Use centralized identity and authentication system",
        "Parent Description": "",
        "Child": "Service Fabric clusters should only use Azure Active Directory for client authentication",
        "Child Description": "Audit usage of client authentication only via Azure Active Directory in Service Fabric.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Manage application identities securely and automatically",
        "Parent Description": "",
        "Child": "Managed identity should be used in your Web App",
        "Child Description": "Use a managed identity for enhanced authentication security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Manage application identities securely and automatically",
        "Parent Description": "",
        "Child": "Managed identity should be used in your Function App",
        "Child Description": "Use a managed identity for enhanced authentication security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Manage application identities securely and automatically",
        "Parent Description": "",
        "Child": "Add system-assigned managed identity to enable Guest Configuration assignments on VMs with a user-assigned identity",
        "Child Description": "This policy adds a system-assigned managed identity to virtual machines hosted in Azure that are supported by Guest Configuration and have at least one user-assigned identity but do not have a system-assigned managed identity. A system-assigned managed identity is a prerequisite for all Guest Configuration assignments and must be added to machines before using any Guest Configuration policy definitions.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Use strong authentication controls",
        "Parent Description": "",
        "Child": "Authentication to Linux machines should require SSH keys",
        "Child Description": "Although SSH itself provides an encrypted connection, using passwords with SSH still leaves the VM vulnerable to brute-force attacks. The most secure option for authenticating to an Azure Linux virtual machine over SSH is with a public-private key pair, also known as SSH keys.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Use strong authentication controls",
        "Parent Description": "",
        "Child": "Ensure that A Multi-factor Authentication Policy Exists for Administrative Groups",
        "Child Description": "For designated users, they will be prompted to use their multi-factor authentication (MFA) process on login.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Use strong authentication controls",
        "Parent Description": "",
        "Child": "Ensure that A Multi-factor Authentication Policy Exists for All Users",
        "Child Description": "For designated users, they will be prompted to use their multi-factor authentication (MFA) process on logins.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Use strong authentication controls",
        "Parent Description": "",
        "Child": "Ensure Multi-factor Authentication is Required for Risky Sign-ins",
        "Child Description": "For designated users, they will be prompted to use their multi-factor authentication (MFA) process on login.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Identity Management",
        "Grand Parent Description": "",
        "Parent": "Use strong authentication controls",
        "Parent Description": "",
        "Child": "Ensure Multi-factor Authentication is Required for Azure Management",
        "Child Description": "For designated users, they will be prompted to use their multi-factor authentication(MFA) process on logins.",
        "Grand Child": "relation \"azuread_conditional_access_policy\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Separate and limit highly privileged/administrative users",
        "Parent Description": "",
        "Child": "A maximum of 3 owners should be designated for your subscription",
        "Child Description": "It is recommended to designate up to 3 subscription owners in order to reduce the potential for breach by a compromised owner.",
        "Grand Child": "1 owner(s) associated.",
        "2023-09-02 00:00:00": "Ok"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Separate and limit highly privileged/administrative users",
        "Parent Description": "",
        "Child": "Deprecated accounts with owner permissions should be removed from your subscription",
        "Child Description": "Deprecated accounts with owner permissions should be removed from your subscription. Deprecated accounts are accounts that have been blocked from signing in.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Separate and limit highly privileged/administrative users",
        "Parent Description": "",
        "Child": "Deprecated accounts with owner permissions should be removed from your subscription",
        "Child Description": "Deprecated accounts with owner permissions should be removed from your subscription. Deprecated accounts are accounts that have been blocked from signing in.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Separate and limit highly privileged/administrative users",
        "Parent Description": "",
        "Child": "External accounts with owner permissions should be removed from your subscription",
        "Child Description": "External accounts with owner permissions should be removed from your subscription in order to prevent unmonitored access.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Separate and limit highly privileged/administrative users",
        "Parent Description": "",
        "Child": "External accounts with owner permissions should be removed from your subscription",
        "Child Description": "External accounts with owner permissions should be removed from your subscription in order to prevent unmonitored access.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Separate and limit highly privileged/administrative users",
        "Parent Description": "",
        "Child": "There should be more than one owner assigned to your subscription",
        "Child Description": "It is recommended to designate more than one subscription owner in order to have administrator access redundancy.",
        "Grand Child": "1 owner(s) associated.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Avoid standing access for accounts and permissions",
        "Parent Description": "",
        "Child": "Management ports of virtual machines should be protected with just-in-time network access control.",
        "Child Description": "Possible network Just In Time (JIT) access will be monitored by Azure Security Center as recommendations",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "Deprecated accounts with owner permissions should be removed from your subscription",
        "Child Description": "Deprecated accounts with owner permissions should be removed from your subscription. Deprecated accounts are accounts that have been blocked from signing in.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "Deprecated accounts should be removed from your subscription",
        "Child Description": "Deprecated accounts should be removed from your subscriptions. Deprecated accounts are accounts that have been blocked from signing in.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "Deprecated accounts should be removed from your subscription",
        "Child Description": "Deprecated accounts should be removed from your subscriptions. Deprecated accounts are accounts that have been blocked from signing in.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "Deprecated accounts with owner permissions should be removed from your subscription",
        "Child Description": "Deprecated accounts with owner permissions should be removed from your subscription. Deprecated accounts are accounts that have been blocked from signing in.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "External accounts with owner permissions should be removed from your subscription",
        "Child Description": "External accounts with owner permissions should be removed from your subscription in order to prevent unmonitored access.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "External accounts with read permissions should be removed from your subscription",
        "Child Description": "External accounts with read privileges should be removed from your subscription in order to prevent unmonitored access.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "External accounts with write permissions should be removed from your subscription",
        "Child Description": "External accounts with write privileges should be removed from your subscription in order to prevent unmonitored access.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "External accounts with owner permissions should be removed from your subscription",
        "Child Description": "External accounts with owner permissions should be removed from your subscription in order to prevent unmonitored access.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "External accounts with read permissions should be removed from your subscription",
        "Child Description": "External accounts with read privileges should be removed from your subscription in order to prevent unmonitored access.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Review and reconcile user access regularly",
        "Parent Description": "",
        "Child": "Ensure Guest Users Are Reviewed on a Regular Basis",
        "Child Description": "Azure AD is extended to include Azure AD B2B collaboration, allowing you to invite people from outside your organization to be guest users in your cloud account and sign in with their own work, school, or social identities. Guest users allow you to share your company's applications and services with users from any other organization, while maintaining control over your own corporate data. Work with external partners, large or small, even if they don't have Azure AD or an IT department. A simple invitation and redemption process lets partners use their own credentials to access your company's resources as a guest user. Guest users in every subscription should be review on a regular basis to ensure that inactive and unneeded accounts are removed.",
        "Grand Child": "relation \"azuread_user\" does not exist (SQLSTATE 42P01)",
        "2023-09-02 00:00:00": "Error"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Follow just enough administration (least privilege) principle",
        "Parent Description": "",
        "Child": "Audit usage of custom RBAC rules",
        "Child Description": "Audit built-in roles such as 'Owner, Contributor, Reader' instead of custom RBAC roles, which are error prone. Using custom roles is treated as an exception and requires a rigorous review and threat modeling.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Privileged Access",
        "Grand Parent Description": "",
        "Parent": "Follow just enough administration (least privilege) principle",
        "Parent Description": "",
        "Child": "Enable role-based access control (RBAC) within Azure Kubernetes Services",
        "Child Description": "Ensure that RBAC is enabled on all Azure Kubernetes Services Instances.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Monitor anomalies and threats targeting sensitive data",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Azure SQL Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Azure SQL Databases enables threat detection for Azure SQL database servers, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Monitor anomalies and threats targeting sensitive data",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Open-Source Relational Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Open-source relational databases enables threat detection for Open-source relational databases, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Monitor anomalies and threats targeting sensitive data",
        "Parent Description": "",
        "Child": "Ensure that Microsoft Defender for SQL servers on machines is set to 'On'",
        "Child Description": "Turning on Microsoft Defender for SQL servers on machines enables threat detection for SQL servers on machines, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Monitor anomalies and threats targeting sensitive data",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected SQL Managed Instances",
        "Child Description": "Audit each SQL Managed Instance without advanced data security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Monitor anomalies and threats targeting sensitive data",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Storage Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Storage enables threat detection for Storage, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Ensure web app redirects all HTTP traffic to HTTPS in Azure App Service",
        "Child Description": "Azure Web Apps allows sites to run under both HTTP and HTTPS by default. Web apps can be accessed by anyone using non-secure HTTP links by default. Non-secure HTTP requests can be restricted and all HTTP requests redirected to the secure HTTPS port. It is recommended to enforce HTTPS-only traffic.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "FTPS only should be required in your API App",
        "Child Description": "Enable FTPS enforcement for enhanced security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Latest TLS version should be used in your Web App",
        "Child Description": "Upgrade to the latest TLS version.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Containers Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Containers enables threat detection for Container Registries including Kubernetes, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Enforce SSL connection should be enabled for PostgreSQL database servers",
        "Child Description": "Azure Database for PostgreSQL supports connecting your Azure Database for PostgreSQL server to client applications using Secure Sockets Layer (SSL). Enforcing SSL connections between your database server and your client applications helps protect against 'man in the middle' attacks by encrypting the data stream between the server and your application. This configuration enforces that SSL is always enabled for accessing your database server",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Function App should only be accessible over HTTPS",
        "Child Description": "Use of HTTPS ensures server/service authentication and protects data in transit from network layer eavesdropping attacks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "FTPS only should be required in your Function App",
        "Child Description": "Enable FTPS enforcement for enhanced security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Latest TLS version should be used in your Function App",
        "Child Description": "Upgrade to the latest TLS version.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Web Application should only be accessible over HTTPS",
        "Child Description": "Use of HTTPS ensures server/service authentication and protects data in transit from network layer eavesdropping attacks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Only secure connections to your Azure Cache for Redis should be enabled",
        "Child Description": "Audit enabling of only connections via SSL to Azure Cache for Redis. Use of secure connections ensures authentication between the server and the service and protects data in transit from network layer attacks such as man-in-the-middle, eavesdropping, and session-hijacking.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Ensure that 'Secure transfer required' is set to 'Enabled'",
        "Child Description": "Enable data encryption in transit.",
        "Grand Child": "cs210032000de891a1b encryption in transit enabled.",
        "2023-09-02 00:00:00": "Ok"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Encrypt sensitive data in transit",
        "Parent Description": "",
        "Child": "Windows web servers should be configured to use secure communication protocols",
        "Child Description": "To protect the privacy of information communicated over the Internet, your web servers should use the latest version of the industry-standard cryptographic protocol, Transport Layer Security (TLS). TLS secures communications over a network by using security certificates to encrypt a connection between machines.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Enable data at rest encryption by default",
        "Parent Description": "",
        "Child": "Ensure Azure Keyvaults are used to store secrets",
        "Child Description": "Encryption keys, Certificate thumbprints and Managed Identity Credentials can be coded into the APP service, this renders them visible as part of the configuration, to maintain security of these keys it is better to store in an Azure Keyvault and reference them from the Keyvault.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Enable data at rest encryption by default",
        "Parent Description": "",
        "Child": "Service Fabric clusters should have the ClusterProtectionLevel property set to EncryptAndSign",
        "Child Description": "Service Fabric provides three levels of protection (None, Sign and EncryptAndSign) for node-to-node communication using a primary cluster certificate. Set the protection level to ensure that all node-to-node messages are encrypted and digitally signed.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Enable data at rest encryption by default",
        "Parent Description": "",
        "Child": "Transparent Data Encryption on SQL databases should be enabled",
        "Child Description": "Transparent data encryption should be enabled to protect data-at-rest and meet compliance requirements.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Enable data at rest encryption by default",
        "Parent Description": "",
        "Child": "Virtual machines should encrypt temp disks, caches, and data flows between Compute and Storage resources",
        "Child Description": "Virtual machines without an enabled disk encryption will be monitored by Azure Security Center as recommendations.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Cosmos DB accounts should use customer-managed keys to encrypt data at rest",
        "Child Description": "Use customer-managed keys to manage the encryption at rest of your Azure Cosmos DB. By default, the data is encrypted at rest with service-managed keys, but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enable the data to be encrypted with an Azure Key Vault key created and owned by you. You have full control and responsibility for the key lifecycle, including rotation and management.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Machine Learning workspaces should be encrypted with a customer-managed key",
        "Child Description": "Manage encryption at rest of Azure Machine Learning workspace data with customer-managed keys. By default, customer data is encrypted with service-managed keys, but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enable the data to be encrypted with an Azure Key Vault key created and owned by you. You have full control and responsibility for the key lifecycle, including rotation and management.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Cognitive Services accounts should enable data encryption with a customer-managed key",
        "Child Description": "Customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enable the data stored in Cognitive Services to be encrypted with an Azure Key Vault key created and owned by you. You have full control and responsibility for the key lifecycle, including rotation and management.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Container registries should be encrypted with a customer-managed key",
        "Child Description": "Use customer-managed keys to manage the encryption at rest of the contents of your registries. By default, the data is encrypted at rest with service-managed keys, but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enable the data to be encrypted with an Azure Key Vault key created and owned by you. You have full control and responsibility for the key lifecycle, including rotation and management.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "MySQL servers should use customer-managed keys to encrypt data at rest",
        "Child Description": "Use customer-managed keys to manage the encryption at rest of your MySQL servers. By default, the data is encrypted at rest with service-managed keys, but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enable the data to be encrypted with an Azure Key Vault key created and owned by you. You have full control and responsibility for the key lifecycle, including rotation and management.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "PostgreSQL servers should use customer-managed keys to encrypt data at rest",
        "Child Description": "Use customer-managed keys to manage the encryption at rest of your PostgreSQL servers. By default, the data is encrypted at rest with service-managed keys, but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enable the data to be encrypted with an Azure Key Vault key created and owned by you. You have full control and responsibility for the key lifecycle, including rotation and management.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "SQL managed instances should use customer-managed keys to encrypt data at rest",
        "Child Description": "Implementing Transparent Data Encryption (TDE) with your own key provides you with increased transparency and control over the TDE Protector, increased security with an HSM-backed external service, and promotion of separation of duties. This recommendation applies to organizations with a related compliance requirement.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "SQL servers should use customer-managed keys to encrypt data at rest",
        "Child Description": "Implementing Transparent Data Encryption (TDE) with your own key provides increased transparency and control over the TDE Protector, increased security with an HSM-backed external service, and promotion of separation of duties. This recommendation applies to organizations with a related compliance requirement.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Storage accounts should use customer-managed key for encryption",
        "Child Description": "Secure your storage account with greater flexibility using customer-managed keys. When you specify a customer-managed key, that key is used to protect and control access to the key that encrypts your data. Using customer-managed keys provides additional capabilities to control rotation of the key encryption key or cryptographically erase data.",
        "Grand Child": "cs210032000de891a1b not encrypted with CMK.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Use a secure key management process",
        "Parent Description": "",
        "Child": "Key Vault keys should have an expiration date",
        "Child Description": "Cryptographic keys should have a defined expiration date and not be permanent. Keys that are valid forever provide a potential attacker with more time to compromise the key. It is a recommended security practice to set expiration dates on cryptographic keys.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Use a secure key management process",
        "Parent Description": "",
        "Child": "Key Vault secrets should have an expiration date",
        "Child Description": "Secrets should have a defined expiration date and not be permanent. Secrets that are valid forever provide a potential attacker with more time to compromise them. It is a recommended security practice to set expiration dates on secrets.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Use a secure certificate management process",
        "Parent Description": "",
        "Child": "Ensure the web app has 'Client Certificates (Incoming client certificates)' set to 'On'",
        "Child Description": "Client certificates allow for the app to request a certificate for incoming requests. Only clients that have a valid certificate will be able to reach the app.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Ensure security of key and certificate repository",
        "Parent Description": "",
        "Child": "Ensure that Private Endpoints are Used for Azure Key Vault",
        "Child Description": "Private endpoints will secure network traffic from Azure Key Vault to the resources requesting secrets and keys.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Ensure security of key and certificate repository",
        "Parent Description": "",
        "Child": "Azure Defender for Key Vault should be enabled",
        "Child Description": "Azure Defender for Key Vault provides an additional layer of protection and security intelligence by detecting unusual and potentially harmful attempts to access or exploit key vault accounts.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Ensure security of key and certificate repository",
        "Parent Description": "",
        "Child": "Key vaults should have purge protection enabled",
        "Child Description": "Malicious deletion of a key vault can lead to permanent data loss. A malicious insider in your organization can potentially delete and purge key vaults. Purge protection protects you from insider attacks by enforcing a mandatory retention period for soft deleted key vaults. No one inside your organization or Microsoft will be able to purge your key vaults during the soft delete retention period.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Data Protection",
        "Grand Parent Description": "",
        "Parent": "Ensure security of key and certificate repository",
        "Parent Description": "",
        "Child": "Key vaults should have soft delete enabled",
        "Child Description": "Deleting a key vault without soft delete enabled permanently deletes all secrets, keys, and certificates stored in the key vault. Accidental deletion of a key vault can lead to permanent data loss. Soft delete allows you to recover an accidentally deleted key vault for a configurable retention period.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Asset Management",
        "Grand Parent Description": "",
        "Parent": "Use only approved services",
        "Parent Description": "",
        "Child": "Storage accounts should be migrated to new Azure Resource Manager resources",
        "Child Description": "Use new Azure Resource Manager for your storage accounts to provide security enhancements such as: stronger access control (RBAC), better auditing, Azure Resource Manager based deployment and governance, access to managed identities, access to key vault for secrets, Azure AD-based authentication and support for tags and resource groups for easier security management.",
        "Grand Child": "cs210032000de891a1b uses azure resource manager.",
        "2023-09-02 00:00:00": "Ok"
    },
    {
        "Grand Parent": "Asset Management",
        "Grand Parent Description": "",
        "Parent": "Use only approved services",
        "Parent Description": "",
        "Child": "Virtual machines should be migrated to new Azure Resource Manager resources",
        "Child Description": "Use new Azure Resource Manager for your virtual machines to provide security enhancements such as: stronger access control (RBAC), better auditing, Azure Resource Manager based deployment and governance, access to managed identities, access to key vault for secrets, Azure AD-based authentication and support for tags and resource groups for easier security management.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Asset Management",
        "Grand Parent Description": "",
        "Parent": "Use only approved applications in virtual machine",
        "Parent Description": "",
        "Child": "Adaptive application controls for defining safe applications should be enabled on your machines",
        "Child Description": "Enable application controls to define the list of known-safe applications running on your machines, and alert you when other applications run. This helps harden your machines against malware. To simplify the process of configuring and maintaining your rules, Security Center uses machine learning to analyze the applications running on each machine and suggest the list of known-safe applications.",
        "Grand Child": "Manual verification required. Check control description for more details.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Asset Management",
        "Grand Parent Description": "",
        "Parent": "Use only approved applications in virtual machine",
        "Parent Description": "",
        "Child": "Allowlist rules in your adaptive application control policy should be updated",
        "Child Description": "Monitor for changes in behavior on groups of machines configured for auditing by Azure Security Center's adaptive application controls. Security Center uses machine learning to analyze the running processes on your machines and suggest a list of known-safe applications. These are presented as recommended apps to allow in adaptive application control policies.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for App Service should be enabled",
        "Child Description": "Azure Defender for App Service leverages the scale of the cloud, and the visibility that Azure has as a cloud provider, to monitor for common web app attacks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Azure SQL Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Azure SQL Databases enables threat detection for Azure SQL database servers, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for DNS should be enabled",
        "Child Description": "Azure Defender for DNS provides an additional layer of protection for your cloud resources by continuously monitoring all DNS queries from your Azure resources. Azure Defender alerts you about suspicious activity at the DNS layer.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for Key Vault should be enabled",
        "Child Description": "Azure Defender for Key Vault provides an additional layer of protection and security intelligence by detecting unusual and potentially harmful attempts to access or exploit key vault accounts.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Open-Source Relational Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Open-source relational databases enables threat detection for Open-source relational databases, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for Resource Manager should be enabled",
        "Child Description": "Azure Defender for Resource Manager automatically monitors the resource management operations in your organization. Azure Defender detects threats and alerts you about suspicious activity.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for servers should be enabled",
        "Child Description": "Azure Defender for servers provides real-time threat protection for server workloads and generates hardening recommendations as well as alerts about suspicious activities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Ensure that Microsoft Defender for SQL servers on machines is set to 'On'",
        "Child Description": "Turning on Microsoft Defender for SQL servers on machines enables threat detection for SQL servers on machines, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected Azure SQL servers",
        "Child Description": "Audit SQL servers without Advanced Data Security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected SQL Managed Instances",
        "Child Description": "Audit each SQL Managed Instance without advanced data security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Ensure that Azure Defender is set to On for Storage",
        "Child Description": "Turning on Azure Defender enables threat detection for Storage, providing threat intelligence, anomaly detection, and behavior analytics in the Azure Security Center.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Azure Defender for Kubernetes should be enabled",
        "Child Description": "Azure Defender for Kubernetes provides real-time threat protection for containerized environments and generates alerts for suspicious activities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Containers Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Containers enables threat detection for Container Registries including Kubernetes, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection capabilities",
        "Parent Description": "",
        "Child": "Windows Defender Exploit Guard should be enabled on your machines",
        "Child Description": "Windows Defender Exploit Guard uses the Azure Policy Guest Configuration agent. Exploit Guard has four components that are designed to lock down devices against a wide variety of attack vectors and block behaviors commonly used in malware attacks while enabling enterprises to balance their security risk and productivity requirements (Windows only).",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for App Service should be enabled",
        "Child Description": "Azure Defender for App Service leverages the scale of the cloud, and the visibility that Azure has as a cloud provider, to monitor for common web app attacks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Azure SQL Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Azure SQL Databases enables threat detection for Azure SQL database servers, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for DNS should be enabled",
        "Child Description": "Azure Defender for DNS provides an additional layer of protection for your cloud resources by continuously monitoring all DNS queries from your Azure resources. Azure Defender alerts you about suspicious activity at the DNS layer.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for Key Vault should be enabled",
        "Child Description": "Azure Defender for Key Vault provides an additional layer of protection and security intelligence by detecting unusual and potentially harmful attempts to access or exploit key vault accounts.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Open-Source Relational Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Open-source relational databases enables threat detection for Open-source relational databases, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for Resource Manager should be enabled",
        "Child Description": "Azure Defender for Resource Manager automatically monitors the resource management operations in your organization. Azure Defender detects threats and alerts you about suspicious activity.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for servers should be enabled",
        "Child Description": "Azure Defender for servers provides real-time threat protection for server workloads and generates hardening recommendations as well as alerts about suspicious activities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Ensure that Microsoft Defender for SQL servers on machines is set to 'On'",
        "Child Description": "Turning on Microsoft Defender for SQL servers on machines enables threat detection for SQL servers on machines, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected Azure SQL servers",
        "Child Description": "Audit SQL servers without Advanced Data Security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected SQL Managed Instances",
        "Child Description": "Audit each SQL Managed Instance without advanced data security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Ensure that Azure Defender is set to On for Storage",
        "Child Description": "Turning on Azure Defender enables threat detection for Storage, providing threat intelligence, anomaly detection, and behavior analytics in the Azure Security Center.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Azure Defender for Kubernetes should be enabled",
        "Child Description": "Azure Defender for Kubernetes provides real-time threat protection for containerized environments and generates alerts for suspicious activities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Containers Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Containers enables threat detection for Container Registries including Kubernetes, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable threat detection for identity and access management",
        "Parent Description": "",
        "Child": "Windows Defender Exploit Guard should be enabled on your machines",
        "Child Description": "Windows Defender Exploit Guard uses the Azure Policy Guest Configuration agent. Exploit Guard has four components that are designed to lock down devices against a wide variety of attack vectors and block behaviors commonly used in malware attacks while enabling enterprises to balance their security risk and productivity requirements (Windows only).",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Diagnostic logs in App Services should be enabled",
        "Child Description": "Audit enabling of diagnostic logs on the app. This enables you to recreate activity trails for investigation purposes if a security incident occurs or your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Auditing on SQL server should be enabled",
        "Child Description": "Auditing on your SQL Server should be enabled to track database activities across all databases on the server and save them in an audit log.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Azure Data Lake Store should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Azure Stream Analytics should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Batch accounts should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Data Lake Analytics should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Event Hub should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in IoT Hub should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Key Vault should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Logic Apps should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Search services should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Service Bus should be enabled",
        "Child Description": "Audit enabling of resource logs. This enables you to recreate activity trails to use for investigation purposes; when a security incident occurs or when your network is compromised.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable logging for security investigation",
        "Parent Description": "",
        "Child": "Resource logs in Virtual Machine Scale Sets should be enabled",
        "Child Description": "It is recommended to enable Logs so that activity trail can be recreated when investigations are required in the event of an incident or a compromise.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable network logging for security investigation",
        "Parent Description": "",
        "Child": "Network traffic data collection agent should be installed on Linux virtual machines",
        "Child Description": "Security Center uses the Microsoft Dependency agent to collect network traffic data from your Azure virtual machines to enable advanced network protection features such as traffic visualization on the network map, network hardening recommendations and specific network threats.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Enable network logging for security investigation",
        "Parent Description": "",
        "Child": "Network traffic data collection agent should be installed on Windows virtual machines",
        "Child Description": "Security Center uses the Microsoft Dependency agent to collect network traffic data from your Azure virtual machines to enable advanced network protection features such as traffic visualization on the network map, network hardening recommendations and specific network threats.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Centralize security log management and analysis",
        "Parent Description": "",
        "Child": "Auto provisioning of the Log Analytics agent should be enabled on your subscription",
        "Child Description": "To monitor for security vulnerabilities and threats, Azure Security Center collects data from your Azure virtual machines. Data is collected by the Log Analytics agent, formerly known as the Microsoft Monitoring Agent (MMA), which reads various security-related configurations and event logs from the machine and copies the data to your Log Analytics workspace for analysis. We recommend enabling auto provisioning to automatically deploy the agent to all supported Azure VMs and any new ones that are created.",
        "Grand Child": "Automatic provisioning of monitoring agent is off.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Centralize security log management and analysis",
        "Parent Description": "",
        "Child": "Log Analytics agent should be installed on your Linux Azure Arc machines",
        "Child Description": "This policy audits Linux Azure Arc machines if the Log Analytics agent is not installed.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Centralize security log management and analysis",
        "Parent Description": "",
        "Child": "Log Analytics agent should be installed on your Windows Azure Arc machines",
        "Child Description": "This policy audits Windows Azure Arc machines if the Log Analytics agent is not installed.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Centralize security log management and analysis",
        "Parent Description": "",
        "Child": "The Log Analytics agent should be installed on virtual machines",
        "Child Description": "This policy audits any Windows/Linux virtual machines if the Log Analytics agent is not installed.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Centralize security log management and analysis",
        "Parent Description": "",
        "Child": "The Log Analytics agent should be installed on Virtual Machine Scale Sets",
        "Child Description": "This policy audits any Windows/Linux Virtual Machine Scale Sets if the Log Analytics agent is not installed.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Logging and Threat Detection",
        "Grand Parent Description": "",
        "Parent": "Configure log storage retention",
        "Parent Description": "",
        "Child": "SQL servers with auditing to storage account destination should be configured with 90 days retention or higher",
        "Child Description": "For incident investigation purposes, we recommend setting the data retention for your SQL Server' auditing to storage account destination to at least 90 days. Confirm that you are meeting the necessary retention rules for the regions in which you are operating. This is sometimes required for compliance with regulatory standards.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Email notification for high severity alerts should be enabled",
        "Child Description": "To ensure the relevant people in your organization are notified when there is a potential security breach in one of your subscriptions, enable email notifications for high severity alerts in Security Center.",
        "Grand Child": "\"Notify about alerts with the following severity\" not set to High.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Email notification to subscription owner for high severity alerts should be enabled",
        "Child Description": "To ensure your subscription owners are notified when there is a potential security breach in their subscription, set email notifications to subscription owners for high severity alerts in Security Center.",
        "Grand Child": "\"All users with the following roles\" not set to Owner.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Subscriptions should have a contact email address for security issues",
        "Child Description": "To ensure the relevant people in your organization are notified when there is a potential security breach in one of your subscriptions, set a security contact to receive email notifications from Security Center.",
        "Grand Child": "Additional email addresses not configured.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for App Service should be enabled",
        "Child Description": "Azure Defender for App Service leverages the scale of the cloud, and the visibility that Azure has as a cloud provider, to monitor for common web app attacks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Azure SQL Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Azure SQL Databases enables threat detection for Azure SQL database servers, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for DNS should be enabled",
        "Child Description": "Azure Defender for DNS provides an additional layer of protection for your cloud resources by continuously monitoring all DNS queries from your Azure resources. Azure Defender alerts you about suspicious activity at the DNS layer.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for Key Vault should be enabled",
        "Child Description": "Azure Defender for Key Vault provides an additional layer of protection and security intelligence by detecting unusual and potentially harmful attempts to access or exploit key vault accounts.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Open-Source Relational Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Open-source relational databases enables threat detection for Open-source relational databases, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for Resource Manager should be enabled",
        "Child Description": "Azure Defender for Resource Manager automatically monitors the resource management operations in your organization. Azure Defender detects threats and alerts you about suspicious activity.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for servers should be enabled",
        "Child Description": "Azure Defender for servers provides real-time threat protection for server workloads and generates hardening recommendations as well as alerts about suspicious activities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure that Microsoft Defender for SQL servers on machines is set to 'On'",
        "Child Description": "Turning on Microsoft Defender for SQL servers on machines enables threat detection for SQL servers on machines, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected Azure SQL servers",
        "Child Description": "Audit SQL servers without Advanced Data Security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected SQL Managed Instances",
        "Child Description": "Audit each SQL Managed Instance without advanced data security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure that Azure Defender is set to On for Storage",
        "Child Description": "Turning on Azure Defender enables threat detection for Storage, providing threat intelligence, anomaly detection, and behavior analytics in the Azure Security Center.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Containers Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Containers enables threat detection for Container Registries including Kubernetes, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in brazilsouth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in westcentralus.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in jioindiacentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in polandcentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in jioindiawest.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in southcentralus.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in westus2.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in francecentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in uaecentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in japaneast.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in switzerlandwest.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in francesouth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in qatarcentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in switzerlandnorth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in norwaywest.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in australiacentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in northeurope.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in westus.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in swedencentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in westus3.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in uaenorth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in eastasia.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in japanwest.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in centralindia.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in southafricanorth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in brazilus.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in eastus2.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in westeurope.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in australiaeast.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in canadacentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in southafricawest.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in germanynorth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in southeastasia.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in eastus.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in northcentralus.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in australiasoutheast.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in ukwest.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in koreasouth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in centralus.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in brazilsoutheast.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in canadaeast.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in westindia.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in uksouth.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in southindia.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in koreacentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in australiacentral2.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in germanywestcentral.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Network Watcher should be enabled",
        "Child Description": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. It is required to have a network watcher resource group to be created in every region where a virtual network is present. An alert is enabled if a network watcher resource group is not available in a particular region.",
        "Grand Child": "Network watcher not enabled in norwayeast.",
        "2023-09-02 00:00:00": "Alarm"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for App Service should be enabled",
        "Child Description": "Azure Defender for App Service leverages the scale of the cloud, and the visibility that Azure has as a cloud provider, to monitor for common web app attacks.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Azure SQL Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Azure SQL Databases enables threat detection for Azure SQL database servers, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for DNS should be enabled",
        "Child Description": "Azure Defender for DNS provides an additional layer of protection for your cloud resources by continuously monitoring all DNS queries from your Azure resources. Azure Defender alerts you about suspicious activity at the DNS layer.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for Key Vault should be enabled",
        "Child Description": "Azure Defender for Key Vault provides an additional layer of protection and security intelligence by detecting unusual and potentially harmful attempts to access or exploit key vault accounts.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Open-Source Relational Databases Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Open-source relational databases enables threat detection for Open-source relational databases, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for Resource Manager should be enabled",
        "Child Description": "Azure Defender for Resource Manager automatically monitors the resource management operations in your organization. Azure Defender detects threats and alerts you about suspicious activity.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for servers should be enabled",
        "Child Description": "Azure Defender for servers provides real-time threat protection for server workloads and generates hardening recommendations as well as alerts about suspicious activities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure that Microsoft Defender for SQL servers on machines is set to 'On'",
        "Child Description": "Turning on Microsoft Defender for SQL servers on machines enables threat detection for SQL servers on machines, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected Azure SQL servers",
        "Child Description": "Audit SQL servers without Advanced Data Security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Azure Defender for SQL should be enabled for unprotected SQL Managed Instances",
        "Child Description": "Audit each SQL Managed Instance without advanced data security.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Storage Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Storage enables threat detection for Storage, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Ensure That Microsoft Defender for Containers Is Set To 'On'",
        "Child Description": "Turning on Microsoft Defender for Containers enables threat detection for Container Registries including Kubernetes, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "Function apps should have 'Client Certificates (Incoming client certificates)' enabled",
        "Child Description": "Client certificates allow for the app to request a certificate for incoming requests. Only clients with valid certificates will be able to reach the app.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "Remote debugging should be turned off for Web Applications",
        "Child Description": "Remote debugging requires inbound ports to be opened on a web application. Remote debugging should be turned off.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "CORS should not allow every resource to access your Web Applications",
        "Child Description": "Cross-Origin Resource Sharing (CORS) should not allow all domains to access your web application. Allow only required domains to interact with your web app.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "Azure Policy Add-on for Kubernetes service (AKS) should be installed and enabled on your clusters",
        "Child Description": "Azure Policy Add-on for Kubernetes service (AKS) extends Gatekeeper v3, an admission controller webhook for Open Policy Agent (OPA), to apply at-scale enforcements and safeguards on your clusters in a centralized, consistent manner.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "Function apps should have 'Client Certificates (Incoming client certificates)' enabled",
        "Child Description": "Client certificates allow for the app to request a certificate for incoming requests. Only clients with valid certificates will be able to reach the app.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "Remote debugging should be turned off for Function Apps",
        "Child Description": "Remote debugging requires inbound ports to be opened on function apps. Remote debugging should be turned off.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "CORS should not allow every resource to access your Function Apps",
        "Child Description": "Cross-Origin Resource Sharing (CORS) should not allow all domains to access your Function app. Allow only required domains to interact with your Function app.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations",
        "Parent Description": "",
        "Child": "Kubernetes cluster pods and containers should only run with approved user and group IDs",
        "Child Description": "Control the user, primary group, supplemental group and file system group IDs that pods and containers can use to run in a Kubernetes Cluster. This recommendation is part of Pod Security Policies which are intended to improve the security of your Kubernetes environments. This policy is generally available for Kubernetes Service (AKS), and preview for AKS Engine and Azure Arc enabled Kubernetes.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations for compute resources",
        "Parent Description": "",
        "Child": "Guest Configuration extension should be installed on your machines",
        "Child Description": "To ensure secure configurations of in-guest settings of your machine, install the Guest Configuration extension. In-guest settings that the extension monitors include the configuration of the operating system, application configuration or presence, and environment settings. Once installed, in-guest policies will be available such as 'Windows Exploit guard should be enabled'.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations for compute resources",
        "Parent Description": "",
        "Child": "Linux machines should meet requirements for the Azure compute security baseline",
        "Child Description": "Requires that prerequisites are deployed to the policy assignment scope. Machines are non-compliant if the machine is not configured correctly for one of the recommendations in the Azure compute security baseline.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations for compute resources",
        "Parent Description": "",
        "Child": "Virtual machines' Guest Configuration extension should be deployed with system-assigned managed identity",
        "Child Description": "The Guest Configuration extension requires a system assigned managed identity. Azure virtual machines in the scope of this policy will be non-compliant when they have the Guest Configuration extension installed but do not have a system assigned managed identity.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Audit and enforce secure configurations for compute resources",
        "Parent Description": "",
        "Child": "Windows machines should meet requirements of the Azure compute security baseline",
        "Child Description": "Requires that prerequisites are deployed to the policy assignment scope. Machines are non-compliant if the machine is not configured correctly for one of the recommendations in the Azure compute security baseline.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Perform vulnerability assessments",
        "Parent Description": "",
        "Child": "A vulnerability assessment solution should be enabled on your virtual machines",
        "Child Description": "Audits virtual machines to detect whether they are running a supported vulnerability assessment solution. A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. Azure Security Center's standard pricing tier includes vulnerability scanning for your virtual machines at no extra cost. Additionally, Security Center can automatically deploy this tool for you.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Perform vulnerability assessments",
        "Parent Description": "",
        "Child": "Vulnerability assessment should be enabled on SQL Managed Instance",
        "Child Description": "Audit each SQL Managed Instance which doesn't have recurring vulnerability assessment scans enabled. Vulnerability assessment can discover, track, and help you remediate potential database vulnerabilities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Perform vulnerability assessments",
        "Parent Description": "",
        "Child": "Vulnerability assessment should be enabled on your SQL servers",
        "Child Description": "Audit Azure SQL servers which do not have recurring vulnerability assessment scans enabled. Vulnerability assessment can discover, track, and help you remediate potential database vulnerabilities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "System updates should be installed on your machines",
        "Child Description": "Missing security system updates on your servers will be monitored by Azure Security Center as recommendations.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Ensure that 'Java version' is the latest, if used as a part of the Web app",
        "Child Description": "Periodically, newer versions are released for Java software either due to security flaws or to include additional functionality. Using the latest Java version for web apps is recommended in order to take advantage of security fixes, if any, and/or new functionalities of the latest version. Currently, this policy only applies to Linux web apps.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Ensure that 'PHP version' is the latest, if used as a part of the WEB app",
        "Child Description": "Periodically, newer versions are released for PHP software either due to security flaws or to include additional functionality. Using the latest PHP version for web apps is recommended in order to take advantage of security fixes, if any, and/or new functionalities of the latest version. Currently, this policy only applies to Linux web apps.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Ensure that 'Python version' is the latest, if used as a part of the Web app",
        "Child Description": "Periodically, newer versions are released for Python software either due to security flaws or to include additional functionality. Using the latest Python version for web apps is recommended in order to take advantage of security fixes, if any, and/or new functionalities of the latest version. Currently, this policy only applies to Linux web apps.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Vulnerabilities in Azure Container Registry images should be remediated",
        "Child Description": "Container image vulnerability assessment scans your registry for security vulnerabilities on each pushed container image and exposes detailed findings for each image (powered by Qualys). Resolving the vulnerabilities can greatly improve your containers' security posture and protect them from attacks.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Ensure that 'Java version' is the latest, if used as a part of the Function app",
        "Child Description": "Periodically, newer versions are released for Java software either due to security flaws or to include additional functionality. Using the latest Java version for Function apps is recommended in order to take advantage of security fixes, if any, and/or new functionalities of the latest version. Currently, this policy only applies to Linux web apps.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Ensure that 'Python version' is the latest, if used as a part of the Function app",
        "Child Description": "Periodically, newer versions are released for Python software either due to security flaws or to include additional functionality. Using the latest Python version for Function apps is recommended in order to take advantage of security fixes, if any, and/or new functionalities of the latest version. Currently, this policy only applies to Linux web apps.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "SQL databases should have vulnerability findings resolved",
        "Child Description": "Monitor vulnerability assessment scan results and recommendations for how to remediate database vulnerabilities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "SQL servers on machines should have vulnerability findings resolved",
        "Child Description": "SQL vulnerability assessment scans your database for security vulnerabilities, and exposes any deviations from best practices such as misconfigurations, excessive permissions, and unprotected sensitive data. Resolving the vulnerabilities found can greatly improve your database security posture.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "System updates should be installed on your machines",
        "Child Description": "Missing security system updates on your servers will be monitored by Azure Security Center as recommendations.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Vulnerabilities in container security configurations should be remediate",
        "Child Description": "Audit vulnerabilities in security configuration on machines with Docker installed and display as recommendations in Azure Security Center.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Vulnerabilities in security configuration on your machines should be remediated",
        "Child Description": "Servers which do not satisfy the configured baseline will be monitored by Azure Security Center as recommendations.",
        "Grand Child": "Manual verification required. Check control description for more details.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Posture and Vulnerability Management",
        "Grand Parent Description": "",
        "Parent": "Rapidly and automatically remediate vulnerabilities",
        "Parent Description": "",
        "Child": "Vulnerabilities in security configuration on your virtual machine scale sets should be remediated",
        "Child Description": "Audit the OS vulnerabilities on your virtual machine scale sets to protect them from attacks.",
        "Grand Child": "Manual verification required. Check control description for more details.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "Endpoint Security",
        "Grand Parent Description": "",
        "Parent": "Use Endpoint Detection and Response (EDR)",
        "Parent Description": "",
        "Child": "Azure Defender for servers should be enabled",
        "Child Description": "Azure Defender for servers provides real-time threat protection for server workloads and generates hardening recommendations as well as alerts about suspicious activities.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Endpoint protection solution should be installed on virtual machine scale sets",
        "Child Description": "Audit the existence and health of an endpoint protection solution on your virtual machines scale sets, to protect them from threats and vulnerabilities.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Monitor missing Endpoint Protection in Azure Security Center",
        "Child Description": "Servers without an installed Endpoint Protection agent will be monitored by Azure Security Center as recommendations.",
        "Grand Child": "Manual verification required. Check control description for more details.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "",
        "Grand Parent Description": "",
        "Parent": "",
        "Parent Description": "",
        "Child": "Windows Defender Exploit Guard should be enabled on your machines",
        "Child Description": "Windows Defender Exploit Guard uses the Azure Policy Guest Configuration agent. Exploit Guard has four components that are designed to lock down devices against a wide variety of attack vectors and block behaviors commonly used in malware attacks while enabling enterprises to balance their security risk and productivity requirements (Windows only).",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Backup and Recovery",
        "Grand Parent Description": "",
        "Parent": "Ensure regular automated backups",
        "Parent Description": "",
        "Child": "Geo-redundant backup should be enabled for Azure Database for MariaDB",
        "Child Description": "Azure Database for MariaDB allows you to choose the redundancy option for your database server. It can be set to a geo-redundant backup storage in which the data is not only stored within the region in which your server is hosted, but is also replicated to a paired region to provide recovery option in case of a region failure. Configuring geo-redundant storage for backup is only allowed during server create.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Backup and Recovery",
        "Grand Parent Description": "",
        "Parent": "Ensure regular automated backups",
        "Parent Description": "",
        "Child": "Geo-redundant backup should be enabled for Azure Database for MySQL",
        "Child Description": "Azure Database for MySQL allows you to choose the redundancy option for your database server. It can be set to a geo-redundant backup storage in which the data is not only stored within the region in which your server is hosted, but is also replicated to a paired region to provide recovery option in case of a region failure. Configuring geo-redundant storage for backup is only allowed during server create.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Backup and Recovery",
        "Grand Parent Description": "",
        "Parent": "Ensure regular automated backups",
        "Parent Description": "",
        "Child": "Geo-redundant backup should be enabled for Azure Database for PostgreSQL",
        "Child Description": "Azure Database for PostgreSQL allows you to choose the redundancy option for your database server. It can be set to a geo-redundant backup storage in which the data is not only stored within the region in which your server is hosted, but is also replicated to a paired region to provide recovery option in case of a region failure. Configuring geo-redundant storage for backup is only allowed during server create.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Backup and Recovery",
        "Grand Parent Description": "",
        "Parent": "Protect backup and recovery data",
        "Parent Description": "",
        "Child": "Geo-redundant backup should be enabled for Azure Database for MariaDB",
        "Child Description": "Azure Database for MariaDB allows you to choose the redundancy option for your database server. It can be set to a geo-redundant backup storage in which the data is not only stored within the region in which your server is hosted, but is also replicated to a paired region to provide recovery option in case of a region failure. Configuring geo-redundant storage for backup is only allowed during server create.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Backup and Recovery",
        "Grand Parent Description": "",
        "Parent": "Protect backup and recovery data",
        "Parent Description": "",
        "Child": "Geo-redundant backup should be enabled for Azure Database for MySQL",
        "Child Description": "Azure Database for MySQL allows you to choose the redundancy option for your database server. It can be set to a geo-redundant backup storage in which the data is not only stored within the region in which your server is hosted, but is also replicated to a paired region to provide recovery option in case of a region failure. Configuring geo-redundant storage for backup is only allowed during server create.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "Backup and Recovery",
        "Grand Parent Description": "",
        "Parent": "Protect backup and recovery data",
        "Parent Description": "",
        "Child": "Geo-redundant backup should be enabled for Azure Database for PostgreSQL",
        "Child Description": "Azure Database for PostgreSQL allows you to choose the redundancy option for your database server. It can be set to a geo-redundant backup storage in which the data is not only stored within the region in which your server is hosted, but is also replicated to a paired region to provide recovery option in case of a region failure. Configuring geo-redundant storage for backup is only allowed during server create.",
        "Grand Child": "Not applicable.",
        "2023-09-02 00:00:00": "Not applicable"
    },
    {
        "Grand Parent": "DevOps Security",
        "Grand Parent Description": "",
        "Parent": "Enforce security of workload throughout DevOps lifecycle",
        "Parent Description": "",
        "Child": "Vulnerabilities in Azure Container Registry images should be remediated",
        "Child Description": "Container image vulnerability assessment scans your registry for security vulnerabilities on each pushed container image and exposes detailed findings for each image (powered by Qualys). Resolving the vulnerabilities can greatly improve your containers' security posture and protect them from attacks.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    },
    {
        "Grand Parent": "DevOps Security",
        "Grand Parent Description": "",
        "Parent": "Enforce security of workload throughout DevOps lifecycle",
        "Parent Description": "",
        "Child": "Vulnerabilities in container security configurations should be remediate",
        "Child Description": "Audit vulnerabilities in security configuration on machines with Docker installed and display as recommendations in Azure Security Center.",
        "Grand Child": "Manual verification required.",
        "2023-09-02 00:00:00": "Manual"
    }
]